'''Задание 3 (2 балла): Опишите класс для векторов в N-мерном пространстве.
В качестве основы используйте список значений координат вектора, задаваемый list.
Обеспечьте поддержку следующих операций: сложение, вычитание (с созданием нового вектора-результата),
скалярное произведение, косинус угла, евклидова норма. Все операции, которые можно перегрузить
с помощью магических методов, должны быть реализованы именно через них. Класс должен производить
проверку консистентности аргументов для каждой операции и в случаях ошибок выбрасывать исключение
ValueError с исчерпывающим объяснением ошибки.

class Vector:
    def __init__(self, vector_values_list):
        pass'''