'''Задание 1 (2 балла): Дайте подробные ответы на следующие вопросы:

В чём смысл инкапсуляции? Приведите пример конкретной ситуации в коде, в которой нарушение инкапсуляции
приводит к проблемам.
Какой метод называется статическим? Что такое параметр self?
В чём отличия методов __new__ и __init__?
Какие виды отношений классов вы знаете? Для каждого приведите примеры. Укажите взаимные различия.
Зачем нужны фабрики? Опишите смысл использования фабричного метода, фабрики и абстрактной фабрики,
а также их взаимные
отличия.'''